Revit 2027 API
MultistoryStairs.CanConnectLevel Method
 Checks if the given level can be connected into multistory stairs. You cannot connect levels between standard stairs top and bottom or already connected.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanConnectLevel(
	ElementId levelId
)
Public Function CanConnectLevel (
	levelId As ElementId
) As Boolean
public:
bool CanConnectLevel(
	ElementId^ levelId
)
member CanConnectLevel :
        levelId : ElementId -> bool
Parameters
levelId ElementId
 The id of the level.
Return Value
Boolean
 True if the level can be connected to this multistory stairs, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace